03Rails/W4D3/cats99/app/controllers/cats_controller.rb

  def index
    @heading = "All cats"
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    @cat = Cat.find(params[:id])
    @heading = "#{@cat.name}'s Data"
    @cat_rental_requests = CatRentalRequest.where(cat_id: @cat.id)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 1]]

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "name", "color", "sex", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "mozart"], ["sex", "M"], ["description", ""], ["updated_at", "2015-01-06 23:14:55.111855"], ["id", 1]]