03Rails/W4D3/cats99/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "yoda"]]
---
  def create
    user = User.find_by(username: session_params[:username])